final_app/app/controllers/goods_controller.rb

SELECT "goods".* FROM "goods"
---
  def index
    @goods = Good.all

INSERT INTO "goods" ("title", "price", "amount", "integer", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["title", "pomidor"], ["price", 228], ["amount", "45"], ["integer", "1"], ["created_at", "2020-12-10 17:58:09.062966"], ["updated_at", "2020-12-10 17:58:09.062966"]]
---
  def create
    @good = Good.new(good_params)

    respond_to do |format|
      if @good.save

SELECT "goods".* FROM "goods" WHERE "goods"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
---
  def set_good
    @good = Good.find(params[:id])