final_app_v2/app/controllers/api/v1/products_controller.rb

SELECT "products".* FROM "products" ORDER BY "products"."name" DESC
---
  def index
    product = Product.all.order(name: :desc)