final_app_v2/app/controllers/api/v1/products_controller.rb

  def index
    product = Product.all.order(id: :desc)
---
SELECT "products".* FROM "products" ORDER BY "products"."id" DESC

  def create
    product = Product.create!(product_params)
---
INSERT INTO "products" ("name", "price", "amount", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["name", "wqer"], ["price", 134], ["amount", 22], ["created_at", "2020-12-11 03:34:41.973562"], ["updated_at", "2020-12-11 03:34:41.973562"]]

  def edit
    @product ||= Product.find(params[:id])
    @product.update(name: params[:name])
    @product.update(price: params[:price])
    @product.update(amount: params[:amount])
---
SELECT "products".* FROM "products" WHERE "products"."id" = ? LIMIT ?  [["id", nil], ["LIMIT", 1]]
UPDATE "products" SET "name" = ?, "updated_at" = ? WHERE "products"."id" = ?  [["name", "Dave"], ["updated_at", "2020-12-11 11:24:55.050883"], ["id", 17]]
UPDATE "products" SET "price" = ?, "updated_at" = ? WHERE "products"."id" = ?  [["price", 12345], ["updated_at", "2020-12-11 12:56:37.425543"], ["id", 21]]
UPDATE "products" SET "amount" = ?, "updated_at" = ? WHERE "products"."id" = ?  [["amount", 322], ["updated_at", "2020-12-11 12:58:09.090775"], ["id", 21]]

  def destroy
    product&.destroy
---
DELETE FROM "products" WHERE "products"."id" = ?  [["id", 17]]

  def product
    @product ||= Product.find(params[:id])
---
SELECT "products".* FROM "products" WHERE "products"."id" = ? LIMIT ?  [["id", 16], ["LIMIT", 1]]